[
	{
		"id": "1",
		"url": "duality-of-financial-advices",
		"title": "The Duality of Financial Advices",
		"description": "People say: \"You have to spend money to make money.\" But is it really true?",
		"text": "Lately, I've been hearing the phrase \"You have to spend money to make money,\" and it got me thinking, is that really true? Contemplating these things seems important to me because, like everyone else, I constantly deal with money, and, of course, I want to have more rather than less. In general, I believe the answer to the survey above is a mundane but honest \"It depends on the context.\"<br><br>Let's start with when, in my opinion, this expression holds true. It applies to business and investments. I'll immediately clarify that everything that follows is by no means financial advice, and it's the opinion of an amateur at best. In my understanding, to make substantial money, you need to invest substantial money first. Moreover, the faster you want to achieve the desired profit, the larger that initial investment must be. It's like the joke about Kayrat who bought apples for 500 tenge, sold them for 100 tenge, and became a millionaire. How? He was just a billionaire. In reality, of course, a person is unlikely to sell at a loss (although such business strategies do exist), but the essence remains the same. To increase your profit, you must constantly reinvest your income back into the business. I agree with this perspective, and it makes logical sense. You invest capital, receive income, use the new capital to hire more workers/improve the technological process, and so on. Your income grows, and you repeat this process until you're satisfied. Therefore, the phrase makes sense in this context, and that's why some of you voted \"Agree.\" A small note, I realized after publication that I only used male gender in the survey options, for which I apologize, and I'll try not to repeat such mistakes in the future.<br><br>Despite my agreement with this expression in the context of expanding a business, that's not the context in which I usually hear it. I typically hear it when it comes to non-essential spending. Non-essential spending refers to expenditures that you can live perfectly well without, like going to a more expensive café, buying unnecessary snacks, and so on. Of course, everything depends on the context, and there may be valid reasons for the expenses I listed, but I hope you understand my point of view. In this case, I find this expression to be misleading. You begin spending money because you've earned it, and the more you earn, the more you spend, not the other way around. If you start spending more money than you earn, you'll only accumulate debt. Someone might argue that this motivates people to work more and increase their income. This is generally correct, but only if you also want to add a hefty dose of stress and feel like a squirrel on a wheel alongside your increased income. Furthermore, one could argue that the mere desire to spend more drives individuals to work harder and gain more resources. However, I find this approach overly consumeristic. I'm referring to situations where you want to start dining out every week and upgrading your iPhone every year, not when you want to \"spend\" more money on, say, your child's education. Such excessive resource consumption for luxury and personal enjoyment is detrimental to our society.<br><br>In conclusion, people who talk about serious finances and investments and already know whether the statement above is true or not. However, what troubles me is how some people justify various forms of excessive spending using these words. This is why I believe the statement is incorrect. In short, handle your money wisely, use your own judgment, and live happily! If you'd like to further discuss this topic, please feel free to do so in the comments under this and the previous posts.<br><br>P.S. This post was written in conjunction with a post in the Telegram channel, which featured a survey with the headline \"You have to spend money to make money.\" (https://t.me/TrottTheDev/100)\"",
		"image": "",
		"date": "2023-09-27",
		"author": "Temirlan Amanzhanov"
	},
	{
		"id": "2",
		"url": "electric-cars-are-terrible",
		"title": "Electric Cars Are Terrible, and All Other Cars Are Even Worse",
		"description": "The Myth of Electric Cars: The Road to a Greener Future?",
		"text": "I'll take a slight detour from the topic of computers. Not too long ago, I decided to take a walk from the center of the right bank of Nur-Sultan to the airport located at the opposite end of the city. During most of the journey, I was amazed at the vast, unoccupied spaces in our city, how much more convenient it is to get around by car, and how challenging it is to do so on foot, by bicycle, or on a scooter. Some might argue that this is only natural and that cars are simply superior to other means of city transportation, but I hold the opposite view. Because, like many other cities, our city was designed to prioritize the convenience of car users over pedestrians, making it significantly more difficult to move around the city on foot.<br><br>Shifting the focus to cars (in this post, \"car\" equals \"automobile\"), there are often suggestions to replace current internal combustion engine cars with hybrid and electric vehicles, claiming that this is a more eco-friendly option that reduces one's carbon footprint. In reality, it's mostly a marketing ploy, and the reality is far from simple. Electric cars come with numerous issues, beginning with the fact that their production does more harm to the environment due to the same batteries and ending with the simple fact that they are heavier, which significantly accelerates road deterioration. I would argue that, aside from exhaust emissions, another critical problem with cars is the very concept of cars themselves. A two-ton machine used for transporting 1-5 people over medium distances is essentially doomed to fail. Parking lots and highways are parts of urban infrastructure created exclusively for cars, contributing to the worsening of the situation. More parking lots result in greater distances between key points in the city, motivating more people to buy cars, which, in turn, necessitates larger parking facilities. It's a vicious cycle. And I haven't even covered all the issues associated with cars.<br><br>So, what should we do?<br><br>Break the vicious cycle! Build infrastructure for pedestrians and bicycles, not cars. If people don't have a need to purchase cars, there will be far fewer metal emissions from hell (a comical dramatization) roaming the city streets. Such cities already exist, like Amsterdam in the Netherlands.<br><br>P.S. Yes, all the facts presented above are without source references because I don't claim that my posts have any scientific or educational value; these are just my thoughts.<br><br>The video (https://youtu.be/WiI1AcsJlYU), which, along with the content from the Not Just Bikes channel (https://www.youtube.com/c/NotJustBikes), greatly inspired me to write this post. Cars must be abolished! (with rare exceptions)",
		"image": "",
		"date": "2022-06-11",
		"author": "Temirlan Amanzhanov"
	}
]
